Revit 2027 API
CustomExporter Methods
The CustomExporter type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
Export(IList<ElementId>) |  Exports a collection of 3D or 2D views
Export(View) |  Exports one 3D or 2D view
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsRenderingSupported |  Checks if view rendering is currently supported in the running instance of Revit.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CustomExporter Class
Autodesk.Revit.DB Namespace